ТОИР_демо/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/торо_ПредопределенныеСценарииРаботыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПредопределенныеСценарииРаботыСистемы</name>
  <predefined>
    <items>
      <name>ПаспортизацияОборудования</name>
      <description>Паспортизация оборудования</description>
    </items>
    <items>
      <name>ПолныйФункционал</name>
      <description>Полный функционал</description>
    </items>
  </predefined>
  <attributes>
    <name>торо_ИспользоватьСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУведомленияОСобытияхСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьТиповыеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСложныеТехКартыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНаправленияОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьГарантии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьДокументыПринятияИСписанияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетКонтролируемыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетНаработкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетСостоянияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетПусковОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетВыявленныхДефектовОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗамещающихРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРегламентныеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьПланированиеПоЖесткимРемЦиклам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользованиеЛимитовРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОценкиРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РассчитыватьПлановуюСтоимостьРемонтовПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьЛоты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСметыРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРемонтыПоСостоянию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОбщийПланРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВнешниеОснованияДляРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаВыполнениеРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВозможностьОтменыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАналогиНоменклатурыДляРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУправлениеПерсоналом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтатусыДокументовТОиР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКонтрольОтрицательныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНастраиваемыеПредставления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РазрешитьПользовательскуюНастройкуПредставлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартнеровИКонтрагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВыделятьИнвестиционныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУпрощеннуюФормуДефекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьФоновыйРасчетППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОстановочныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОпасноеПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПроведениеАктовСИсполнителямиБезУказанияКвал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАктПриемкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаРегламентноеМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПоказыватьПодсистемуKPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводНаОсновании</name>
    <attributes>
      <name>ПараДокументов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Функция СоздатьЭлементСправочникаНаСервере(ПараметрСоздания,Наименование,Описание, ЭлементСправочника = Неопределено) Экспорт
	
	Если ЭлементСправочника = Неопределено Тогда
		НовыйЭлемент = Справочники.торо_ПредопределенныеСценарииРаботыСистемы.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.Описание     = Описание;

	Иначе
		НовыйЭлемент = ЭлементСправочника.ПолучитьОбъект();
	КонецЕсли; 
	
	ЗначенияКонстант = ПараметрСоздания.Константы;
	
	Для каждого Константа Из ЗначенияКонстант Цикл
		НовыйЭлемент[Константа.Ключ] = Константа.Значение;
	КонецЦикла; 
	
	ВводНаОсновании = ПараметрСоздания.ВводНаОсновании;
	
	Для каждого Элемент Из ВводНаОсновании Цикл
		НС = НовыйЭлемент.ВводНаОсновании.Добавить();
		НС.ПараДокументов = Элемент.Ключ;
		НС.Значение       = Элемент.Значение;
	КонецЦикла;
	
	Попытка
		НовыйЭлемент.Записать();
		Возврат НовыйЭлемент.Ссылка;
	Исключение
		Возврат "Не удалось записать элемент справочника <Сценарии работы системы>"
	КонецПопытки;
	
		
КонецФункции
#КонецОбласти

#КонецЕсли
